package com.wzd.web.dto.response;

public enum ResponseCode implements ResponseCodeType {

    成功(200, "成功"),

    错误请求(400, "错误请求"),

    未授权(401, "未授权"),

    要求付款(402, "要求付款"),

    禁止访问(403, "禁止访问"),

    找不到路径(404, "找不到路径"),

    不允许此方法(405, "不允许此方法"),

    不支持的媒体类型(415, "不支持的媒体类型"),

    不允许为空(418, "不允许为空"),

    不允许重复(419, "不允许重复"),

    资源不存在(420, "资源不存在"),

    错误JSON(499, "错误JSON"),

    服务器异常(500, "服务器异常"),

    未登录(600, "未登录"),

    数据签名错误(601, "数据签名错误"),

    登录超时(602, "登录超时"),

    用户不存在(603, "用户不存在"),

    密码错误(604, "密码错误"),

    导出失败(605, "导出失败"),

    生成Excel表格数据失败(606, "生成Excel表格数据失败"),

    加密失败(607, "加密失败"),

    解密失败(608, "解密失败"),

    类型错误(609, "类型错误"),

    已经签到(610, "已经签到"),

    已领完(611, "已领完"),

    已报名(612, "已报名"),

    未报名(613, "未报名"),

    用户被冻结(614, "用户被冻结"),

    已报满(615, "已报满"),

    已暂停(616, "已暂停"),

    已结束(617, "已结束"),

    未开始(618, "未开始"),

    积分不够(619, "积分不够"),

    投票已截止(620, "投票已截止"),

    次数已用完(621, "当日投票次数已用完"),

    已投票(622, "你对此人已经投过票"),

    调查已结束(623, "问卷调查已结束"),

    投票天数超期(624, "已超过连续投票天数"),

    超答题次数(625, "超过答题次数"),

    已收藏(626, "该招聘信息已经被收藏"),

    下载失败(627, "文件下载失败"),

    活动不存在(628, "活动不存在"),

    文章不存在(629, "文章不存在"),

    文件不存在(630, "文件不存在"),

    福利不存在(631, "福利不存在"),

    未领取福利(632, "没有领取,无法兑换"),

    问卷不存在(633, "该问卷调查已失效或不存在"),

    投票不存在(634, "该投票已结束或不存在"),

    回音壁不存在(635, "回音壁不存在"),

    招聘不存在(636, "招聘信息不存在"),

    无法修改(637, "数据无法修改"),

    无法删除(638, "数据无法删除"),

    部门不存在(639, "部门不存在"),

    采购申请不存在(640, "采购申请不存在"),

    原密码错误(641, "原密码错误"),

    没有认证不能兑换(642, "没有认证不能兑换"),

    领导不存在(643, "领导不存在,无法操作！"),

    已在首位(644, "已经是第一个,无法移动!"),

    已在尾部(645, "已经是最后一个,无法移动!"),

    无法预约(646, "无法预约活动"),

    发送失败(647, "发送失败"),

    投票未开始(648, "投票未开始"),

    调查未开始(649, "调查未开始"),

    请填写完整必填项(650, "请填写完整必填项"),

    数据参数异常(651, "数据参数异常"),

    文件上传大小超出限制(652, "文件上传大小超出限制"),

    当前登录人权限不足(653, "当前登录人权限不足"),

    此手机号已注册(654, "此手机号已注册"),

    请完善所有数据信息(655, "请完善所有数据信息"),

    奖品总数请设置为200件以上(656, "奖品总数请设置为200件以上"),
    无效的咨询类型(657, "无效的咨询类型"),
    无效的参数(658, "无效的参数");

    private int code;

    private String msg;

    ResponseCode(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

}
